# taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "osx-cross/avr"
tap "homebrew/cask-fonts"

# shell tools
cask "kitty"
brew "zsh"
brew "tmux"
brew "git"
brew "wget"
brew "python"

brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "fzf"
brew "tree"

# vim/textedit tools
brew "macvim"
cask "mactex"

# embedded / C tools
brew "gcc"
brew "avr-gcc"
brew "avrdude"
brew "platformio"

# apps
cask "google-chrome"
cask "spotify"
cask "transmission"
cask "visual-studio-code"

# fonts
cask 'font-fira-code'

# fun!
brew "sl"
