# taps
tap "homebrew/bundle"
tap "homebrew/cask"

# shell
brew "zsh"
brew "tmux"
brew "git"
brew "wget"
brew "python"

# embedded / C tools
brew "gcc"
brew "platformio"

# misc tools
brew "neofetch"
brew "tree"
brew "htop"
brew "sl"

# apps
cask "kitty"
cask "macvim"
cask "google-chrome"
cask "spotify"
cask "transmission"
cask "visual-studio-code"
cask "balenaetcher"
cask "ltspice"
cask "basictex"
cask "notion"
