# taps
tap "homebrew/bundle"
tap "homebrew/cask"

# shell
brew "zsh"
brew "git"
brew "wget"
brew "vim"
brew "ripgrep"
brew "python"

# embedded / C tools
brew "gcc"
brew "avr-gcc"
brew "avrdude"
brew "bear"

# misc tools
brew "archey"
brew "tree"
brew "htop"
brew "sl"

# apps
cask "kitty"
cask "google-chrome"
cask "spotify"
cask "transmission"
cask "visual-studio-code"
cask "balenaetcher"
cask "ltspice"
cask "basictex"
cask "notion"
cask "alfred"
